In [34]:
import pandas as pd
import numpy as np

In [35]:
df2=pd.read_csv('spam-email\spam.csv')

<>:1: SyntaxWarning: invalid escape sequence '\s'
<>:1: SyntaxWarning: invalid escape sequence '\s'
C:\Users\ranja\AppData\Local\Temp\ipykernel_17664\2554549958.py:1: SyntaxWarning: invalid escape sequence '\s'
  df2=pd.read_csv('spam-email\spam.csv')

In [36]:
df2.sample(4)

     Category                                            Message
2451      ham                            K..give back my thanks.
3319      ham                  I'm freezing and craving ice. Fml
1989      ham                             Sorry, I'll call later
3629      ham  Meeting u is my work. . . Tel me when shall i ...

In [37]:
df2.rename(columns={'Category':'label','Message':'text'},inplace =True)

In [38]:
df2.sample(5)

     label                                               text
564   spam  GENT! We are trying to contact you. Last weeke...
3679  spam  Promotion Number: 8714714 - UR awarded a City ...
909    ham                    WHITE FUDGE OREOS ARE IN STORES
3822   ham  You are right though. I can't give you the spa...
439    ham  Hi hope u get this txt~journey hasnt been gd,n...

In [39]:
df2.shape

(5572, 2)

In [40]:
df3=pd.read_csv('spam-mails-dataset\spam_ham_dataset.csv')

<>:1: SyntaxWarning: invalid escape sequence '\s'
<>:1: SyntaxWarning: invalid escape sequence '\s'
C:\Users\ranja\AppData\Local\Temp\ipykernel_17664\1260027613.py:1: SyntaxWarning: invalid escape sequence '\s'
  df3=pd.read_csv('spam-mails-dataset\spam_ham_dataset.csv')

In [41]:
df3.sample(5)

,Unnamed: 0,label,text,label_num
3908,1390,ham,Subject: re : enron / hpl actuals for august 1...,0
741,3405,ham,"Subject: happy birthday ! ! !\r\ndaren ,\r\ni ...",0
605,2227,ham,"Subject: re : tenaska iv 10 / 00\r\nmegan , ja...",0
191,4619,spam,Subject: young sluts getting creamy facials fo...,1
2862,1825,ham,Subject: enron / hpl actuals for october 13 - ...,0

In [42]:
df3.drop(columns=['label_num','Unnamed: 0'],inplace=True)

In [43]:
df3.sample(5)

     label                                               text
603    ham  Subject: entex revised estimates for 4 / 00\r\...
783    ham  Subject: double a for 5 / 1 / 01 business\r\nk...
1154  spam  Subject: only $ 16 per malboro carton\r\ntired...
341   spam  Subject: 77 % off for all new software . manes...
2174   ham  Subject: nomination 6 / 1 / 2000 - eastrans\r\...

In [44]:
df4=pd.read_csv('spam-or-not-spam-dataset\spam_or_not_spam.csv')

<>:1: SyntaxWarning: invalid escape sequence '\s'
<>:1: SyntaxWarning: invalid escape sequence '\s'
C:\Users\ranja\AppData\Local\Temp\ipykernel_17664\4018237622.py:1: SyntaxWarning: invalid escape sequence '\s'
  df4=pd.read_csv('spam-or-not-spam-dataset\spam_or_not_spam.csv')

In [45]:
df4.sample(5)

                                                  email  label
1890  url URL date not supplied gregor sez enron cor...      0
1790   forwarded by nev dull nev sleepycat com forwa...      0
708   oh they were plenty upset about the tea taxes ...      0
1947  url URL date NUMBER NUMBER NUMBERtNUMBER NUMBE...      0
498    j james rogers jamesr best com writes j an ex...      0

In [46]:
df4['label'] = df4['label'].replace(0, 'ham')
df4['label'] = df4['label'].replace(1, 'spam')

In [47]:
df4=df4[['label','email']]

In [48]:
df4.rename(columns={'email':'text'},inplace=True)

In [49]:
df4.sample(5)

     label                                               text
2516  spam  help wanted we are a NUMBER year old fortune N...
1438   ham   clark c evans said hello i m hosted on a free...
1940   ham  url URL date NUMBER NUMBER NUMBERtNUMBER NUMBE...
1437   ham  i m getting an error page from URL when i try ...
138    ham  url URL date not supplied steve sez it s tragi...

In [50]:
df5=pd.read_csv('deceptive-opinion-spam-corpus\deceptive-opinion.csv')

<>:1: SyntaxWarning: invalid escape sequence '\d'
<>:1: SyntaxWarning: invalid escape sequence '\d'
C:\Users\ranja\AppData\Local\Temp\ipykernel_17664\1548817154.py:1: SyntaxWarning: invalid escape sequence '\d'
  df5=pd.read_csv('deceptive-opinion-spam-corpus\deceptive-opinion.csv')

In [51]:
df5.sample(5)

,deceptive,hotel,polarity,source,text
675,deceptive,monaco,positive,MTurk,I went to Chicago and We made a reservation to...
540,deceptive,sheraton,positive,MTurk,If there is ever a Hotel you should stay at it...
537,deceptive,sheraton,positive,MTurk,This is an absolutely gorgeous hotel. We had a...
1535,deceptive,palmer,negative,MTurk,The Chicago Palmer House disappointed me. I ch...
692,deceptive,sofitel,positive,MTurk,My stay at the Sofitel was great. I loved the ...

In [52]:
df5.drop(columns=['hotel','deceptive','source'],inplace=True)
df5['polarity'] = df5['polarity'].replace('negative', 'ham')
df5['polarity'] = df5['polarity'].replace('positive', 'spam')
df5.rename(columns={'polarity':'label'},inplace=True)

In [53]:
df5.sample(5)

     label                                               text
508   spam  Downtown Chicago has a multitude of available ...
887    ham  Just wanted to let everyone know if you are lo...
1113   ham  The hotel is in a good location. It is very co...
1535   ham  The Chicago Palmer House disappointed me. I ch...
1242   ham  For starters, I had trouble reaching the front...

In [54]:
df2.shape

(5572, 2)

In [55]:
df3.shape

(5171, 2)

In [56]:
df4.shape

(3000, 2)

In [57]:
df5.shape

(1600, 2)

In [58]:
df = pd.concat([df2, df3, df4, df5], axis=0, ignore_index=True)

In [59]:
df.sample(5)

      label                                               text
6438    ham  Subject: re : entex transistion\r\nthanks so m...
8531    ham  Subject: nom change - effective may 27 , 2000 ...
169     ham  Great escape. I fancy the bridge but needs her...
10389   ham  Subject: re : hpl meter # 981488 paris tenaska...
13584  spam  are you interested in making some extra money ...

In [60]:
df.shape

(15343, 2)

In [61]:
df.isnull().sum()

label    0
text     1
dtype: int64

In [62]:
df.dropna()

      label                                               text
0       ham  Go until jurong point, crazy.. Available only ...
1       ham                      Ok lar... Joking wif u oni...
2      spam  Free entry in 2 a wkly comp to win FA Cup fina...
3       ham  U dun say so early hor... U c already then say...
4       ham  Nah I don't think he goes to usf, he lives aro...
...     ...                                                ...
15338   ham  Problems started when I booked the InterContin...
15339   ham  The Amalfi Hotel has a beautiful website and i...
15340   ham  The Intercontinental Chicago Magnificent Mile ...
15341   ham  The Palmer House Hilton, while it looks good i...
15342   ham  As a former Chicagoan, I'm appalled at the Ama...

[15342 rows x 2 columns]

In [63]:
df[df.duplicated()]

      label                                               text
103     ham  As per your request 'Melle Melle (Oru Minnamin...
154     ham  As per your request 'Melle Melle (Oru Minnamin...
207     ham  As I entered my cabin my PA said, '' Happy B'd...
223     ham                             Sorry, I'll call later
326     ham                   No calls..messages..missed calls
...     ...                                                ...
13734  spam   get NUMBER free vhs or dvds click hyperlink h...
14596   ham  My daughter and I woke in the morning wanting ...
14605   ham  The Omni was chosen for it's location whichwor...
14757   ham  I'd been searching for a cool, non-chain hotel...
14852   ham  Very disappointed in our stay in Chicago Monoc...

[724 rows x 2 columns]

In [64]:
df=df.drop_duplicates()

In [65]:
df.shape

(14619, 2)

In [66]:
df.to_csv('spam_notSpam.csv',index=False)